/**
 * Created by sunwd on 2018/10/16.
 */
const DATA = {
  // 1.X线检查体位方式
  item1: [
    {
      key: 1,
      name: '1，标准投照(MLO+CC)'
    },
    {
      key: 2,
      name: '2，附加体位投照'
    }
  ],
  // 1.1数字化摄影位置？
  item11: [
    {
      key: 1,
      name: '1，左乳'
    },
    {
      key: 2,
      name: '2，右乳'
    },
    {
      key: 3,
      name: '3，双乳'
    }
  ],
  // 1.2屏胶系统位置？
  item12: [
    {
      key: 1,
      name: '1，左乳'
    },
    {
      key: 2,
      name: '2，右乳'
    },
    {
      key: 3,
      name: '3，双乳'
    }
  ],
  // 1.3附加体位投照位置？
  item13: [
    {
      key: 1,
      name: '1，左乳'
    },
    {
      key: 2,
      name: '2，右乳'
    },
    {
      key: 3,
      name: '3，双乳'
    }
  ],
  // 2.X线检查适应症？
  item2: [
    {
      key: 1,
      name: '1，无症状及体征，45岁以上'
    },
    {
      key: 2,
      name: '2，超声可疑发现'
    }
  ],
  // 2.1超声可疑发现
  item21: [
    {
      key: 1,
      name: '1，左乳'
    },
    {
      key: 2,
      name: '2，右乳'
    },
    {
      key: 3,
      name: '3，双乳'
    }
  ],
  // 3.影像评估时是否结合既往乳腺影像资料（胶片，报告）
  item3: [
    {
      key: 1,
      name: '1，否'
    },
    {
      key: 2,
      name: '2，是'
    }
  ],
  // 3.1既往资料距今距离多少？
  item31: [
    {
      key: 1,
      name: '1，6月~1年'
    },
    {
      key: 2,
      name: '2，1~2年'
    },
    {
      key: 3,
      name: '3，2年以上'
    }
  ],
  // 4.乳腺实质BI-RADS 类型属于以下哪种？
  item41: [
    {
      key: 1,
      name: '1，脂肪为主型'
    },
    {
      key: 2,
      name: '2，散在纤维腺体型'
    },
    {
      key: 3,
      name: '3，不均匀致密型，可能掩盖小肿块'
    },
    {
      key: 4,
      name: '4，致密型，降低乳腺摄影的敏感性'
    }
  ],
  // 1.左乳BI-RADS分类？
  item51: [
    {
      key: 1,
      name: '1，0类:需要进一步影像学评估'
    },
    {
      key: 2,
      name: '2，1类: 阴性，无异常所见'
    },
    {
      key: 3,
      name: '3，2类: 典型良性发现'
    },
    {
      key: 4,
      name: '4，3类: 良性可能大'
    },
    {
      key: 5,
      name: '5，4A: 可疑恶性-低度疑似恶性'
    },
    {
      key: 6,
      name: '6，4B: 可疑恶性-中度疑似恶性'
    },
    {
      key: 7,
      name: '7，4C: 可疑恶性-高度疑似恶性'
    },
    {
      key: 8,
      name: '8，5类: 高度提示恶性'
    }
  ],
  // 2.右乳BI-RADS分类？
  item52: [
    {
      key: 1,
      name: '1，0类:需要进一步影像学评估'
    },
    {
      key: 2,
      name: '2，1类: 阴性，无异常所见'
    },
    {
      key: 3,
      name: '3，2类: 典型良性发现'
    },
    {
      key: 4,
      name: '4，3类: 良性可能大'
    },
    {
      key: 5,
      name: '5，4A: 可疑恶性-低度疑似恶性'
    },
    {
      key: 6,
      name: '6，4B: 可疑恶性-中度疑似恶性'
    },
    {
      key: 7,
      name: '7，4C: 可疑恶性-高度疑似恶性'
    },
    {
      key: 8,
      name: '8，5类: 高度提示恶性'
    }
  ],
  // 3.双乳BI-RADS分类？
  item53: [
    {
      key: 1,
      name: '1，0类:需要进一步影像学评估'
    },
    {
      key: 2,
      name: '2，1类: 阴性，无异常所见'
    },
    {
      key: 3,
      name: '3，2类: 典型良性发现'
    },
    {
      key: 4,
      name: '4，3类: 良性可能大'
    },
    {
      key: 5,
      name: '5，4A: 可疑恶性-低度疑似恶性'
    },
    {
      key: 6,
      name: '6，4B: 可疑恶性-中度疑似恶性'
    },
    {
      key: 7,
      name: '7，4C: 可疑恶性-高度疑似恶性'
    },
    {
      key: 8,
      name: '8，5类: 高度提示恶性'
    }
  ],
  // 1.左乳处理建议：
  item61: [
    {
      key: 1,
      name: '1，0类：既往片比较、进一步检查'
    },
    {
      key: 2,
      name: '2，1～2类：常规筛查间隔X线检查'
    },
    {
      key: 3,
      name: '3，3类：短期复查（6月）'
    },
    {
      key: 4,
      name: '4，4类：（4A、4B、4C）考虑活检'
    },
    {
      key: 5,
      name: '5，5类：活检及外科就诊'
    }
  ],
  // 2.右乳处理建议
  item62: [
    {
      key: 1,
      name: '1，0类：既往片比较、进一步检查'
    },
    {
      key: 2,
      name: '2，1～2类：常规筛查间隔X线检查'
    },
    {
      key: 3,
      name: '3，3类：短期复查（6月）'
    },
    {
      key: 4,
      name: '4，4类：（4A、4B、4C）考虑活检'
    },
    {
      key: 5,
      name: '5，5类：活检及外科就诊'
    }
  ],
  // 3.双乳处理建议：
  item63: [
    {
      key: 1,
      name: '1，0类：既往片比较、进一步检查'
    },
    {
      key: 2,
      name: '2，1～2类：常规筛查间隔X线检查'
    },
    {
      key: 3,
      name: '3，3类：短期复查（6月）'
    },
    {
      key: 4,
      name: '4，4类：（4A、4B、4C）考虑活检'
    },
    {
      key: 5,
      name: '5，5类：活检及外科就诊'
    }
  ],
  // 1.是否需要国家癌症中心会诊
  isMeeting: [
    {
      key: 1,
      name: '1，否'
    },
    {
      key: 2,
      name: '2，是'
    }
  ],

  // 乳腺X线影结果像发现信息表
  hosRxxxResultImageDiscoveryInfoPOS: {
    // 1.左乳影像结果有无异常？
    item1: [
      {
        key: 1,
        name: '1，无异常所见'
      },
      {
        key: 2,
        name: '2，有异常'
      }
    ],

    // 2.左乳影像结果有无肿块？
    item2: [
      {
        key: 1,
        name: '1，无'
      },
      {
        key: 2,
        name: '2，有'
      }
    ],
    // 2.1肿块的形态？
    item21: [
      {
        key: 1,
        name: '1，卵圆形'
      },
      {
        key: 2,
        name: '2，圆形'
      },
      {
        key: 3,
        name: '3，不规则形'
      }
    ],
    // 2.2肿块的边缘？
    item22: [
      {
        key: 1,
        name: '1，清晰'
      },
      {
        key: 2,
        name: '2，模糊'
      },
      {
        key: 3,
        name: '3，微小分叶'
      },
      {
        key: 4,
        name: '4，浸润'
      },
      {
        key: 5,
        name: '5，毛刺'
      }
    ],
    // 2.3肿块的密度？
    item23: [
      {
        key: 1,
        name: '1，高密度'
      },
      {
        key: 2,
        name: '2，等密度'
      },
      {
        key: 3,
        name: '3，低密度'
      },
      {
        key: 4,
        name: '4，含脂肪密度'
      }
    ],
    // 2.4肿块的最大径？
    item24: [
      {
        key: 1,
        name: '1，<=1cm'
      },
      {
        key: 2,
        name: '2，>1cm,但<=2cm'
      },
      {
        key: 3,
        name: '3，>2cm,但<=5cm'
      },
      {
        key: 4,
        name: '4，>5cm'
      }
    ],
    // 2.5肿块的象限？
    item25: [
      {
        key: 1,
        name: '1，外上'
      },
      {
        key: 2,
        name: '2，外下'
      },
      {
        key: 3,
        name: '3，内上'
      },
      {
        key: 4,
        name: '4，内下'
      },
      {
        key: 5,
        name: '5，乳晕下'
      },
      {
        key: 6,
        name: '6，中央区'
      },
      {
        key: 7,
        name: '7，腋尾部'
      }
    ],
    // 2.7肿块的深度？
    item27: [
      {
        key: 1,
        name: '1，前部'
      },
      {
        key: 2,
        name: '2，中部'
      },
      {
        key: 3,
        name: '3，后部'
      }
    ],
    // 3.左乳影像结果有无钙化？
    item3: [
      {
        key: 1,
        name: '1，无'
      },
      {
        key: 2,
        name: '2，有'
      }
    ],
    // 3.1钙化类型
    item31: [
      {
        key: 1,
        name: '1，典型良性钙化'
      },
      {
        key: 2,
        name: '2，可疑钙化'
      },
    ],
     // 3.11典型良性钙化的表现
     item31A: [
      {
        key: 1,
        name: '1，皮肤'
      },
      {
        key: 2,
        name: '2，血管'
      },
      {
        key: 3,
        name: '3，粗大或爆米花样'
      },
      {
        key: 4,
        name: '4，大杆状'
      },
      {
        key: 5,
        name: '5，圆形'
      },
      {
        key: 6,
        name: '6，环形'
      },
      {
        key: 7,
        name: '7，其它：营养不良性、钙乳、缝线'
      },
    ],
    // 3.2钙化的形态？
    item32: [
      {
        key: 1,
        name: '1，不定形'
      },
      {
        key: 2,
        name: '2，粗大不均质'
      },
      {
        key: 3,
        name: '3，细小多形性'
      },
      {
        key: 4,
        name: '4，细小线样或细线分支状'
      }
    ],
    // 3.3钙化的分布？
    item33: [
      {
        key: 1,
        name: '1，弥漫'
      },
      {
        key: 2,
        name: '2，区域'
      },
      {
        key: 3,
        name: '3，成簇'
      },
      {
        key: 4,
        name: '4，线样'
      },
      {
        key: 5,
        name: '5，段样'
      }
    ],
    // 3.4钙化的象限？
    item34: [
      {
        key: 1,
        name: '1，外上'
      },
      {
        key: 2,
        name: '2，外下'
      },
      {
        key: 3,
        name: '3，内上'
      },
      {
        key: 4,
        name: '4，内下'
      },
      {
        key: 5,
        name: '5，乳晕下'
      },
      {
        key: 6,
        name: '6，中央区'
      },
      {
        key: 7,
        name: '7，腋尾部'
      }
    ],
    // 3.6钙化的深度？
    item36: [
      {
        key: 1,
        name: '1，前部'
      },
      {
        key: 2,
        name: '2，中部'
      },
      {
        key: 3,
        name: '3，后部'
      }
    ],
    // 4.左乳影像结果有无结构扭曲？
    item4: [
      {
        key: 1,
        name: '1，无'
      },
      {
        key: 2,
        name: '2，有'
      }
    ],
    // 4.1结构扭曲的象限？
    item41: [
      {
        key: 1,
        name: '1，外上'
      },
      {
        key: 2,
        name: '2，外下'
      },
      {
        key: 3,
        name: '3，内上'
      },
      {
        key: 4,
        name: '4，内下'
      },
      {
        key: 5,
        name: '5，乳晕下'
      },
      {
        key: 6,
        name: '6，中央区'
      },
      {
        key: 7,
        name: '7，腋尾部'
      }
    ],
    // 4.3结构扭曲的深度？
    item43: [
      {
        key: 1,
        name: '1，前部'
      },
      {
        key: 2,
        name: '2，中部'
      },
      {
        key: 3,
        name: '3，后部'
      }
    ],
    // 5.左乳影像结果有无局灶性不对称致密？
    item5: [
      {
        key: 1,
        name: '1，无'
      },
      {
        key: 2,
        name: '2，有'
      }
    ],
    // 5.1局灶性不对称致密的象限？
    item51: [
      {
        key: 1,
        name: '1，外上'
      },
      {
        key: 2,
        name: '2，外下'
      },
      {
        key: 3,
        name: '3，内上'
      },
      {
        key: 4,
        name: '4，内下'
      },
      {
        key: 5,
        name: '5，乳晕下'
      },
      {
        key: 6,
        name: '6，中央区'
      },
      {
        key: 7,
        name: '7，腋尾部'
      }
    ],
    // 5.3局灶性不对称致密的深度？
    item53: [
      {
        key: 1,
        name: '1，前部'
      },
      {
        key: 2,
        name: '2，中部'
      },
      {
        key: 3,
        name: '3，后部'
      }
    ],
    // 6.左乳影像结果有无乳头凹陷？
    item6: [
      {
        key: 1,
        name: '1，无'
      },
      {
        key: 2,
        name: '2，有'
      }
    ],
    // 7.左乳影像结果有无皮肤增厚/凹陷？
    item7: [
      {
        key: 1,
        name: '1，无'
      },
      {
        key: 2,
        name: '2，有'
      }
    ],
    // 8.左乳影像结果有无腋窝淋巴结肿大？
    item8: [
      {
        key: 1,
        name: '1，无'
      },
      {
        key: 2,
        name: '2，有'
      }
    ],
    // 9.左乳影像结果有无其他异常？
    item9: [
      {
        key: 1,
        name: '1，无'
      },
      {
        key: 2,
        name: '2，有'
      }
    ]
  }
}

export default DATA