const REPORT_DICTIONARY = {
    // 文化程度
    education: [{
            id: 1,
            name: '1.未正规上过学'
        },
        {
            id: 2,
            name: '2.小学'
        },
        {
            id: 3,
            name: '3.初中'
        },
        {
            id: 4,
            name: '4.高中/中专/技校'
        },
        {
            id: 5,
            name: '5.大专'
        },
        {
            id: 6,
            name: '6.大学及以上'
        },
    ],
    // 婚姻
    marray: [{
            id: 1,
            name: '1.未婚'
        },
        {
            id: 2,
            name: '2.初婚'
        },
        {
            id: 3,
            name: '3.再婚'
        },
        {
            id: 4,
            name: '4.离异'
        },
        {
            id: 5,
            name: '5.丧偶'
        },
        {
            id: 6,
            name: '6.未婚同居'
        }
    ],
    // 职业
    work: [{
            id: 1,
            name: '1.专业技术人员'
        },
        {
            id: 2,
            name: '2.国家机关和企事业单位负责人 '
        },
        {
            id: 3,
            name: '3.职员'
        },
        {
            id: 4,
            name: '4.商人'
        },
        {
            id: 5,
            name: '5.农民'
        },
        {
            id: 6,
            name: '6.工人'
        },
        {
            id: 7,
            name: '7.服务性工作人员'
        },
        {
            id: 8,
            name: '8.家务'
        },
        {
            id: 99,
            name: '99.其他'
        },
    ],
    // 1是0否
    flag: [{
            id: 0,
            name: '0.否'
        },
        {
            id: 1,
            name: '1.是'
        }
    ],
    // 1是0否
    flagRS: [{
            id: 1,
            name: '1.是'
        }, {
            id: 0,
            name: '2.否'
        }

    ],
    // 有害物质
    wz: [{
            id: 1,
            name: '1.石棉'
        },
        {
            id: 2,
            name: '2.氡、铍、铀、铬、镉、镍、硅、矽等'
        },
        {
            id: 3,
            name: '3.柴油废气、煤烟和煤烟灰'
        }
    ],
    // 频度
    pd: [{
            id: 1,
            name: '1.每天'
        },
        {
            id: 2,
            name: '2.每周4-6天'
        },
        {
            id: 3,
            name: '3.每周2-3天'
        },
        {
            id: 4,
            name: '4.每周1天及以下'
        },
    ],
    // 口味
    kw: [{
            id: 1,
            name: '1.咸'
        },
        {
            id: 2,
            name: '2.中'
        },
        {
            id: 3,
            name: '3.淡'
        }
    ],
    // 油烟
    yy: [{
            id: 1,
            name: '1.无烟'
        },
        {
            id: 2,
            name: '2.少许'
        },
        {
            id: 3,
            name: '3.较多'
        },
        {
            id: 4,
            name: '4.很多'
        }
    ],
    // 吸烟
    smoke: [{
            id: 0,
            name: '0.否，从不吸'
        },
        {
            id: 1,
            name: '1.是，目前仍在吸'
        },
        {
            id: 2,
            name: '2.以前吸，目前已戒烟  '
        }
    ],
    // 酒种类
    drink: [{
            id: 1,
            name: '1.啤酒'
        },
        {
            id: 2,
            name: '2. 低度白酒＜40度'
        },
        {
            id: 5,
            name: '3. 高度白酒≥40度'
        },
        {
            id: 3,
            name: '4.葡萄酒/黄酒'
        },
        {
            id: 4,
            name: '5.米酒'
        }
    ],
    // 呼吸疾病
    hxjb: [{
            id: 1,
            name: '1.慢性阻塞性肺疾病'
        },
        {
            id: 2,
            name: '2.肺气肿'
        },
        {
            id: 3,
            name: '3.矽肺或尘肺'
        },
        {
            id: 4,
            name: '4.肺结核'
        },
        {
            id: 99,
            name: '99.其他'
        }
    ],
    // 消化道疾病
    xxdjb: [{
            id: 1,
            name: '1.食管上皮内瘤变'
        },
        {
            id: 2,
            name: '2.慢性萎缩性胃炎'
        },
        {
            id: 3,
            name: '3.肥厚性胃炎'
        },
        {
            id: 4,
            name: '4.胃息肉'
        },
        {
            id: 5,
            name: '5.手术后残胃'
        },
        {
            id: 6,
            name: '6.胃黏膜上皮内瘤变'
        },
        {
            id: 7,
            name: '7.胃肠上皮化生'
        },
        {
            id: 99,
            name: '99.其他'
        }
    ],
    // 肝脏疾病
    gzjb: [{
            id: 1,
            name: '1.慢性乙型肝炎'
        },
        {
            id: 2,
            name: '2.慢性丙型肝炎'
        },
        {
            id: 3,
            name: '3.肝硬化'
        },
        {
            id: 99,
            name: '99.其他'
        }
    ],
    // 结直肠疾病
    jzcjb: [{
            id: 1,
            name: '1.结直肠息肉'
        },
        {
            id: 2,
            name: '2.慢性结肠炎'
        },
        {
            id: 99,
            name: '99.其他'
        }
    ],
    // 其他疾病
    otherjb: [{
            id: 1,
            name: '1.高血压'
        },
        {
            id: 2,
            name: '2.高血脂症'
        },
        {
            id: 3,
            name: '3.糖尿病'
        }
    ],
    // 人数
    num: [{
            id: 1,
            name: '1'
        },
        {
            id: 2,
            name: '2'
        },
        {
            id: 3,
            name: '3'
        },
        {
            id: 4,
            name: '4'
        },
        {
            id: 5,
            name: '5'
        }
    ],
    // 关系
    relation: [{
            id: 1,
            name: '01.母亲'
        },
        {
            id: 2,
            name: '02.父亲'
        },
        {
            id: 3,
            name: '03.姐妹'
        },
        {
            id: 4,
            name: '04.兄弟'
        },
        {
            id: 5,
            name: '05.子女'
        },
        {
            id: 6,
            name: '06.祖父母'
        },
        {
            id: 7,
            name: '07.外祖父母'
        },
        {
            id: 8,
            name: '08.叔伯姑'
        },
        {
            id: 9,
            name: '09.舅姨'
        },
        {
            id: 10,
            name: '10.堂兄弟姐妹'
        },
        {
            id: 11,
            name: '11.表兄弟姐妹'
        },
        {
            id: 99,
            name: '99.其他'
        }
    ],
    // 肿瘤
    zy: [{
            id: 1,
            name: '1.肺癌'
        },
        {
            id: 2,
            name: '2.乳腺癌'
        },
        {
            id: 3,
            name: '3.肝癌'
        },
        {
            id: 4,
            name: '4.食管癌'
        },
        {
            id: 5,
            name: '5.胃癌'
        },
        {
            id: 6,
            name: '6.结直肠癌'
        },
        {
            id: 7,
            name: '7.胰腺癌'
        },
        {
            id: 8,
            name: '8.白血病'
        },
        {
            id: 9,
            name: '9.淋巴瘤'
        },
        {
            id: 10,
            name: '10.脑瘤'
        },
        {
            id: 11,
            name: '11.宫颈癌'
        },
        {
            id: 12,
            name: '12.卵巢癌'
        },
        {
            id: 13,
            name: '13.肾癌'
        },
        {
            id: 99,
            name: '99.其他'
        }

    ],
    // 激素
    jisu: [{
            id: 0,
            name: '0.否'
        },
        {
            id: 1,
            name: '1.是, 仅雌激素 (如更宝芬、补佳乐、协坤、维尼安、更乐、倍美力、得美素、欧适可、松奇、康美华、尼尔雌醇等)'
        },
        {
            id: 2,
            name: '2.是, 雌孕激素联合（如诺康律、诺更宁、克龄蒙、倍美安、倍美盈等）'
        }
    ],
    //活产史
    flagHC: [{
            id: 0,
            name: '0.否（未生育、流产、死胎均包括）'
        },
        {
            id: 1,
            name: '1.是'
        }
    ],
}

export default REPORT_DICTIONARY